Repository: sakarshiekhi/Fadeu
Catalog: fadeu/fadeu/lib/l10n/app_*.arb
Languages: fa

source: Your Activity
fa: فعالیت شما

source: A1 Level
fa: سطح A1

source: A2 Level
fa: سطح A2

source: B1 Level
fa: سطح B1

source: Refresh activity data
fa: به‌روزرسانی داده‌های فعالیت

source: Your Progress at a Glance
fa: پیشرفت شما در یک نگاه

source: Total Study Time
fa: مجموع زمان مطالعه

# totalStudyTimeDescription
source: Total time spent watching videos and learning.
fa: مجموع زمان صرف شده برای تماشای ویدیوها و یادگیری.

source: Words Searched
fa: کلمات جستجو شده

# wordsSearchedDescription
source: Number of unique words you have looked up.
fa: تعداد کلمات منحصر به فردی که جستجو کرده‌اید.

source: Words Saved
fa: کلمات ذخیره شده

# wordsSavedDescription
source: Number of words you have saved for later review.
fa: تعداد کلماتی که برای مرور بعدی ذخیره کرده‌اید.

source: Flashcards Viewed (Total)
fa: فلش‌کارت‌های مشاهده شده (کل)

# flashcardsViewedTotalDescription
source: Total number of flashcards you have reviewed.
fa: مجموع تعداد فلش‌کارت‌هایی که مرور کرده‌اید.

source: Flashcards Viewed by Level
fa: فلش‌کارت‌های مشاهده شده بر اساس سطح

source: Longest Daily Streak
fa: طولانی‌ترین روند روزانه

# longestDailyStreakDescription
source: Your record for consecutive days of app usage.
fa: رکورد شما برای روزهای متوالی استفاده از برنامه.

# lastUsed
source: Last used: {date}
fa: آخرین استفاده: {date}

source: Comparison
fa: مقایسه

# towardsGoal
source: {percent}% towards goal
fa: {percent}% تا رسیدن به هدف

# errorInitializingData
source: Error initializing user activity data. Please restart the app.
fa: خطا در بارگذاری اولیه داده‌های فعالیت کاربر. لطفاً برنامه را مجدداً راه‌اندازی کنید.

# notAvailable
source: N/A
fa: در دسترس نیست

source: flashcards
fa: فلش‌کارت‌ها

source: Your Main Activities
fa: فعالیت‌های اصلی شما

source: Searched
fa: جستجو شده

source: Saved
fa: ذخیره شده

source: Viewed
fa: مشاهده شده

source: minutes
fa: دقیقه

source: words
fa: کلمه

source: days
fa: روز

source: No translation available.
fa: ترجمه‌ای موجود نیست.

source: Refresh
fa: بارگیری مجدد

source: Start typing to search...
fa: برای جستجو تایپ کنید...

source: Error loading search results
fa: خطا در بارگیری نتایج جستجو

source: No translation
fa: بدون ترجمه

source: Word Reminders
fa: یادآور کلمات

# wordRemindersDescription
source: A channel for periodic word learning notifications.
fa: کانالی برای اعلان‌های دوره‌ای یادگیری کلمات.

# failedToLoadTranslations
source: Failed to load translations from server: {error}
fa: بارگیری ترجمه‌ها از سرور ناموفق بود: {error}

# failedToConnectToServer
source: Failed to connect to your server.
fa: اتصال به سرور شما ناموفق بود.

source: Signup successful!
fa: ثبت‌نام با موفقیت انجام شد!

# emailError
source: Email error: {errors}
fa: خطای ایمیل: {errors}

# passwordError
source: Password error: {errors}
fa: خطای رمز عبور: {errors}

source: Signup failed
fa: ثبت‌نام ناموفق بود

# couldNotConnectToServer
source: Error: Could not connect to server
fa: خطا: امکان اتصال به سرور وجود ندارد

source: Login successful!
fa: ورود با موفقیت انجام شد!

# loginFailed
source: Login failed: {reason}
fa: ورود ناموفق بود: {reason}

# noSavedWords
source: No saved words found.
fa: هیچ کلمه ذخیره شده‌ای یافت نشد.

source: Clear All
fa: پاک کردن همه

# clearAllConfirmation
source: Clear All Saved Words?
fa: حذف همه کلمات ذخیره شده؟

# clearAllDescription
source: This will remove all your saved words. This action cannot be undone.
fa: این کار تمام کلمات ذخیره شده شما را حذف می‌کند. این عمل قابل بازگشت نیست.

source: Cancel
fa: انصراف

# wordDetailsError
source: Error loading word details
fa: خطا در بارگذاری جزئیات کلمه

source: Part of Speech
fa: نوع کلمه (نقش دستوری)

source: Level
fa: سطح

# passwordResetEmailSent
source: Password reset email sent successfully!
fa: ایمیل بازنشانی رمز عبور با موفقیت ارسال شد!

source: Failed to send reset email
fa: ارسال ایمیل بازنشانی ناموفق بود

# couldNotConnectToServerCheckInternet
source: Error: Could not connect to server. Please check your internet connection.
fa: خطا: امکان اتصال به سرور وجود ندارد. لطفاً اتصال اینترنت خود را بررسی کنید.

source: Verification failed
fa: تأیید ناموفق بود

source: Password reset successful!
fa: بازنشانی رمز عبور با موفقیت انجام شد!

source: Failed to reset password
fa: بازنشانی رمز عبور ناموفق بود

source: From Your Dictionary
fa: از دیکشنری شما

source: Online Results
fa: نتایج آنلاین

source: Word
fa: کلمه

# createAccountTitle
source: Create Your Account
fa: حساب کاربری خود را بسازید

# emailLabel
source: Email
fa: ایمیل

# emailRequiredError
source: Email is required
fa: وارد کردن ایمیل الزامی است

# invalidEmailError
source: Please enter a valid email address
fa: لطفاً یک آدرس ایمیل معتبر وارد کنید

# passwordLabel
source: Password
fa: رمز عبور

# confirmPasswordLabel
source: Confirm Password
fa: تکرار رمز عبور

# passwordsDoNotMatchError
source: Passwords do not match
fa: رمزهای عبور یکسان نیستند

# signUpButton
source: Sign Up
fa: ثبت‌نام

# alreadyHaveAccount
source: Already have an account? Log In
fa: قبلاً حساب کاربری ساخته‌اید؟ وارد شوید

# requiredFieldError
source: This field is required
fa: این فیلد الزامی است

# passwordLengthError
source: Password must be at least 8 characters long
fa: رمز عبور باید حداقل ۸ کاراکتر باشد

# appTitle
source: Fadeu
fa: فادئو

# searchTooltip
source: Search
fa: جستجو

# flashcardsTab
source: Flashcards
fa: فلش‌کارت‌ها

# savedTab
source: Saved
fa: ذخیره‌شده‌ها

source: Settings
fa: تنظیمات

# settingsTab
source: Settings
fa: تنظیمات

# noWordsFoundForLevel
source: No words found for this level
fa: هیچ کلمه‌ای برای این سطح یافت نشد

# flashcardLevelAll
source: All
fa: همه سطوح

# saveWordTooltip
source: Save word to your collection
fa: ذخیره کلمه در مجموعه شما

# resetRequestFailed
source: Failed to send reset password request
fa: ارسال درخواست بازنشانی رمز عبور ناموفق بود

# resetPasswordTitle
source: Reset Password
fa: بازنشانی رمز عبور

# resetPasswordInstruction
source: Enter your email to receive a password reset link
fa: برای دریافت لینک بازنشانی، ایمیل خود را وارد کنید

# emailHint
source: Email
fa: ایمیل

# weWillSendYouTheCode
source: We'll send you a verification code
fa: کد تأیید برای شما ارسال خواهد شد

# resetEmailSentConfirmation
source: Reset email sent. Please check your inbox.
fa: ایمیل بازنشانی ارسال شد. لطفاً صندوق ورودی خود را بررسی کنید.

# unknownError
source: An unknown error occurred
fa: یک خطای ناشناخته رخ داد

# connectionError
source: Connection error. Please check your internet connection.
fa: خطای اتصال. لطفاً اینترنت خود را بررسی کنید.

# emailValidationError
source: Please enter a valid email address
fa: لطفاً یک آدرس ایمیل معتبر وارد کنید

# passwordHint
source: Password
fa: رمز عبور

# passwordValidationError
source: Password must be at least 6 characters
fa: رمز عبور باید حداقل ۶ کاراکتر باشد

# loginButton
source: Log In
fa: ورود

# forgotPasswordButton
source: Forgot Password?
fa: رمز عبور را فراموش کرده‌اید؟

# skipButton
source: Skip
fa: رد شدن

# setNewPasswordTitle
source: Set New Password
fa: تنظیم رمز عبور جدید

# setNewPasswordInstruction
source: Create a new password for your account
fa: یک رمز عبور جدید برای حساب خود ایجاد کنید

# newPasswordHint
source: New Password
fa: رمز عبور جدید

# confirmPasswordHint
source: Confirm New Password
fa: تکرار رمز عبور جدید

# resetPasswordButton
source: Reset Password
fa: بازنشانی رمز عبور

# resetPasswordError
source: Error resetting password
fa: خطا در بازنشانی رمز عبور

# verifyCodeTitle
source: Verify Code
fa: تأیید کد

# enterCodeInstruction
source: Enter the verification code sent to your email
fa: کد تأیید ارسال شده به ایمیل خود را وارد کنید

# codeHint
source: Verification Code
fa: کد تأیید

# verifyButton
source: Verify
fa: تأیید

source: Language
fa: زبان

source: Theme
fa: پوسته

# userActivity
source: Your Activity
fa: فعالیت شما

source: Notifications
fa: اعلان‌ها

source: Notifications disabled.
fa: اعلان‌ها غیرفعال شد.

source: Improve Notification Delivery
fa: بهبود تحویل اعلان‌ها

# essentialForNotifications
source: Essential for notifications to work correctly on some devices.
fa: برای عملکرد صحیح اعلان‌ها در برخی دستگاه‌ها ضروری است.

# hour
source: 1 hour
fa: ۱ ساعت

source: hours
fa: ساعت

source: minute
fa: دقیقه

source: Notification Settings
fa: تنظیمات اعلان‌ها

source: Start Time
fa: زمان شروع

source: End Time
fa: زمان پایان

source: Frequency
fa: تکرار

source: Word Level
fa: سطح کلمه

source: Enable Learning Sessions
fa: فعال‌سازی جلسات یادگیری

source: All Levels
fa: همه سطوح

# levelA1
source: Beginner (A1)
fa: مبتدی (A1)

# levelA2
source: Elementary (A2)
fa: مقدماتی (A2)

# levelB1
source: Intermediate (B1)
fa: متوسط (B1)

source: Save Settings
fa: ذخیره تنظیمات

source: Sign Up
fa: ثبت‌نام

source: Login
fa: ورود

source: Forgotten Password
fa: فراموشی رمز عبور

source: English Meaning
fa: معنی انگلیسی

source: Article
fa: حرف تعریف (آرتیکل)

source: Plural
fa: جمع

source: Cases
fa: حالت‌ها (گرامری)

source: Tenses
fa: زمان‌ها (فعل)

source: Example (German)
fa: مثال (آلمانی)

source: Example (English)
fa: مثال (انگلیسی)

source: Example (Persian)
fa: مثال (فارسی)

# searchHint
source: Search for words...
fa: جستجوی کلمات...

# noResults
source: No results found
fa: نتیجه‌ای یافت نشد

# noSearchHistory
source: Your search history will appear here.
fa: تاریخچه جستجوی شما اینجا نمایش داده می‌شود.

source: Recent Searches
fa: جستجوهای اخیر

# clearRecentSearches
source: Clear All
fa: حذف همه

source: Try Again
fa: دوباره تلاش کنید

# wordRemoved
source: {word} removed from saved words
fa: {word} از کلمات ذخیره شده حذف شد

# pullToRefresh
source: Pull down to refresh
fa: برای به‌روزرسانی به پایین بکشید

# allWordsCleared
source: All saved words cleared
fa: همه کلمات ذخیره شده حذف شدند
